Repository: 7iotika/doc
Catalog: sphinx/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: FAQ
ru: Вопросы и ответы

source: Why Tarantool?
ru: Почему Tarantool?

source: Tarantool is a result of a long trial and error process within Mail.Ru. It's the Nth generation of a family of custom in-memory data servers, developed for various web applications. Besides, when Tarantool development started (2008) there were no stable and sufficiently functional open source alternative.
ru: Tarantool появился в ходе многолетней разработки и отладки в стенах Mail.Ru. Tarantool -- это специализированный in-memory сервер баз данных N-го поколения, предназначенный для работы с веб-приложениями. В 2008 году, когда разработка Tarantool'а только начиналась, не существовало open-source решений, сравнимых с ним по надежности и функционалу.

source: Why Lua?
ru: Почему Lua?

source: Lua is a lightweight, fast, extensible multi-paradigm language. Lua also happens to be very easy to embed. Lua coroutines relate very closely to Tarantool fibers, and Lua architecture works well with Tarantool internals. Lua is the first, but hopefully not the last, stored program language for Tarantool.
ru: Lua -- это легкий, быстрый и расширяемый язык, позволяющий использовать различные парадигмы программирования. Lua также очень легко встраивается в разные приложения. Ко-рутины (coroutines) в Lua близко соотносятся с файберами (fibers) в Tarantool, а вся Lua-архитектура гладко ложится на внутреннюю реализацию Tarantool'а. Lua -- это первый язык, на котором можно писать хранимые процедуры для Tarantool'а. В будущем список поддерживаемых языков планируется расширить.

source: What's the key advantage of Tarantool?
ru: В чем главное преимущество Tarantool?

source: Tarantool provides a rich database feature set (HASH, TREE, RTREE, BITSET indexes, secondary indexes, composite indexes, transactions, triggers, asynchronous replication) in a flexible environment of a Lua interpreter.
ru: Tarantool предоставляет богатый набор функций по работе с базами данных (HASH, TREE, RTREE, BitSet-индексы, вторичные индексы, составные индексы, транзакции, триггеры, асинхронная репликация), и всё это -- в гибкой среде Lua-интерпретатора.

source: These two properties make it possible to code fast, atomic and reliable in-memory data servers which handle non-trivial application-specific logic. The win over traditional SQL servers is in performance: low-overhead, lock-free architecture means Tarantool can serve an order of magnitude more requests per second, on comparable hardware. The win over NoSQL alternatives is in flexibility: Lua allows flexible processing of data stored in a compact, denormalized format.
ru: Эти два обстоятельства делают Tarantool быстрым и надежным in-memory сервером баз данных с атомарными операциями и сложной логикой на стороне сервера. Преимуществом Tarantool'а по сравнению с традиционными SQL СУБД является его высокая производительность: низкие накладные расходы и безблокировочная архитектура позволяют Tarantool'у обрабатывать на порядок больше запросов в секунду на аналогичном оборудовании. Преимущество же перед другими NoSQL СУБД заключается в большей гибкости Tarantool'а: язык Lua позволяет гибко обрабатывать данные, хранящиеся в компактном, ненормализованном формате.

source: What are your development plans?
ru: Каковы ваши планы по развитию?

source: We continuously improve server performance. On the feature front, automatic sharding and bsync (bidirectional file synchronization) and a subset of SQL are the major goals of 2016.
ru: Мы постоянно улучшаем производительность серверной части. Наши главные цели на 2016 год -- это автоматический шардинг и bsync (двунаправленная синхронизация файлов), а также частичная поддержка SQL.

source: Who is developing Tarantool?
ru: Кто разрабатывает Tarantool?

source: How serious is Mail.Ru about Tarantool?
ru: Насколько серьезны планы Mail.Ru в отношении Tarantool'а?

source: Tarantool is an open source project, distributed under a BSD license, and as such does not depend on any one sponsor. However, it is currently an integral part of Mail.Ru backbone, so it gets a lot of support from Mail.Ru.
ru: Tarantool -- это проект с открытым кодом, распространяемый под лицензией BSD, поэтому он не зависит от спонсоров. В то же время, Tarantool -- это часть технологического "костяка" Mail.Ru, и поэтому он пользуется сильной поддержкой со стороны Mail.Ru.

source: What happens when Tarantool runs out of memory?
ru: Что происходит, когда Tarantool'у не хватает памяти?

source: The server stops accepting updates until more memory is available. Read and delete requests continue to be served without difficulty.
ru: В этой ситуации Tarantool-сервер не принимает запросы на обновление данных до тех пор, пока снова не появится свободная память. Но запросы на чтение и удаление продолжают обрабатываться без проблем.
